app/controllers/assignments_controller.rb

SELECT "assignments".* FROM "assignments"
---
    def index
        #for some reason Assignment.select(:title).uniq modifies id params
        @assignments = Assignment.all

SELECT "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT 1  [["id", "show"]]
---
    def show
        id = params[:id]
        @assignment = Assignment.find(id)

SELECT "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT 1  [["id", "5"]]
---
    def edit
        @assignment = Assignment.find(params[:id])

SELECT "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "assignments" WHERE "assignments"."id" = ?  [["id", 1]]
---
    def destroy
        @assignment = Assignment.find(params[:id])
        #delete all instances of this assignment
        @assignments = Assignment.where("title = ?", @assignment.title)
        @assignments.each do |assignment|
            assignment.destroy

SELECT "assignments".* FROM "assignments" WHERE "assignments"."id" = ? LIMIT 1  [["id", "22"]]
SELECT "assignments".* FROM "assignments" WHERE "assignments"."title" = 'No' LIMIT 1
DELETE FROM "assignments" WHERE "assignments"."id" = ?  [["id", 22]]
---
    def update
        @assignment = Assignment.find(params[:id])
        @assignments = Assignment.where("title = ?", @assignment.title)
        if params[:file]
            #delete all assignments and make new ones
            @assignments.each do |assignment|
                assignment.destroy